app/Http/Controllers/AuthController.php

    public function register(Request $request)
    {
        $fields = $request->validate([
            'name' => 'required|string',
            'email' => 'required|string|unique:users,email',
            'password' => 'required|string|confirmed'
        ]);

        $user = User::create([
            'name' => $fields['name'],
            'email' => $fields['email'],
            'password' => Hash::make($fields['password']),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('\"edilberto2 firmino2\"', '\"edilberto2@gmail.com\"', '$2y$10$RVNsVBakhQNzBAMdM/OSY.VFZroVIGDtfM3PrlVpVRe.ocq2YE2ZW', '2024-07-17 16:15:51', '2024-07-17 16:15:51')

    public function login(Request $request)
    {
        $fields = $request->validate([
            'email' => 'required|string',
            'password' => 'required|string'
        ]);

        $user = User::where('email', $fields['email'])->first();
---
select * from `users` where `email` = '\"joao@example.com\"' limit 1